/***********************************************************************************************
文件名	SYSOS.c
日期	2013.8.6
作者	张诗星	陈东辉
文件说明	协作式任务实现文件
修订说明:

2013.08.06  张诗星 初始版本
***********************************************************************************************/

/*头文件--------------------------------------------------------------------------------------*/
//#include ""
#include "SYSOS.h"

/*全局变量------------------------------------------------------------------------------------*/

OS_CTaskMask taskMask;

#if OS_01_STATITASK==1			/*使能空闲任务*/
unsigned long OS_IdleCtr;		/*空闲任务计数变量*/
unsigned long OS_IdleCtrMax;	/*空闲任务计数全速运行最大值*/
unsigned char OS_CPUPerc;		/*CPU使用百分比*/

/*函数定义------------------------------------------------------------------------------------*/
//空闲任务
void OS_IdleTask(void)
{
	++OS_IdleCtr;
}
//统计任务 每秒调用一次
void OS_StatisTask(void)
{
	OS_CPUPerc = 100-(unsigned char)((OS_IdleCtr*100)/OS_IdleCtrMax);/*计算CPU使用率*/
	OS_IdleCtr=0;									/*复位计数器*/
}
//空闲时统计空闲任务调用速率函数
void OS_StatisIdle(void)
{
	OS_IdleCtr=0;
	OS_CPUPerc=0;
}
#endif
